#include "stm32f10x.h"

/********************************************************************
 *简	介：微秒级延时
 *参	数：延时时长，范围：0~233015
 *返回值：无
 *说	明：无
 *********************************************************************/
void Delay_us(uint32_t xus)
{
	SysTick->LOAD = 72 * xus;				//设置定时器重装值
	SysTick->VAL = 0x00;					//清空当前计数值
	SysTick->CTRL = 0x00000005;				//设置时钟源为HCLK，启动定时器
	while(!(SysTick->CTRL & 0x00010000));	//等待计数到0
	SysTick->CTRL = 0x00000004;				//关闭定时器
}

/********************************************************************
 *简	介：毫秒级延时
 *参	数：延时时长，范围：0~4294967295
 *返回值：无
 *说	明：无
 *********************************************************************/
void Delay_ms(uint32_t xms)
{
	while(xms--)
	{
		Delay_us(1000);
	}
}
 
/********************************************************************
 *简	介：秒级延时
 *参	数：延时时长，范围：0~4294967295
 *返回值：无
 *说	明：无
 *********************************************************************/
void Delay_s(uint32_t xs)
{
	while(xs--)
	{
		Delay_ms(1000);
	}
} 
